package ex04;

public class User {
//	배열을 이용하여 사용자 정보를 저장하고, 메소드를 오버로딩하여 사용자의 로그인과 회원가입 기능을 구현하기
//	User 클래스
//	사용자의 아이디와 비밀번호를 관리
//	UserManager 클래스
//	회원가입 및 로그인 기능을 관리
//	로그인 시에는 입력된 아이디와 비밀번호를 확인하여 로그인 여부를 반환
//	단, 최대 5명의 사용자만 저장가능, 그 이상 추가될 경우 더이상 회원가입이 불가능합니다라는 메시지 출력할 것
//	모든 필드의 접근 제한자는 private으로 설정할것
	
//	로직구성
//	User 클래스 안에서 사용자의 이름, id, pw 접근제한자가 private인 필드 생성
//	사용자 정보 5개를 저장할 배열 생성
//	배열에 5개의 사용자 정보 입력
//	입력 클래스 import
//	아이디와 비밀번호를 입력받을 변수 선언
//	입력 메소드를 통하여 아이디와 비밀번호 입력받기
//	조건문을 사용하여 배열안에 있는 사용자 정보의 아이디와 비밀번호가 일치하면 로그인되었습니다 출력
//	일치하지 않으면 아아디 또는 비밀번호가 틀렸습니다 출력
//	배열안에 사용자 정보가 5개 이상일 경우 회원가입이 불가능 합니다 출력
}
